# IFCBuiltInCategoryKey Properties

---
The IFCBuiltInCategoryKey type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCBuiltInCategoryKey Class
Autodesk.Revit.DB Namespace